hellosamblack/CrowPanelProp/firmware/communicator/sdkconfig.defaults
# Target + board defaults for the communicator prop firmware.
# Generated as a starting point; run `idf.py set-target esp32p4` then `idf.py menuconfig` to refine.

CONFIG_IDF_TARGET="esp32p4"

# This board uses an early P4 (chip revision v1.3 / engineering sample). IDF 6.0
# defaults to v3.x silicon, which refuses to boot on it. Switch to the pre-v3
# line (supports rev 0.x/1.x, max v1.99) and set the minimum to v1.0.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Custom partition table with factory + ota_0 + ota_1 (copied from Lesson09) so WiFi OTA works.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Board has 16 MB flash; needed for the factory + ota_0 + ota_1 partition layout.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM (32 MB on board) — needed for LVGL framebuffers.
CONFIG_SPIRAM=y

# NOTE: do NOT raise CONFIG_LV_MEM_SIZE_KILOBYTES above 32 — esp_hosted's SDIO
# DMA mempool needs internal RAM and cannot move to PSRAM, so a bigger LV_MEM
# triggers "HS_MP: mempool create failed: no mem" and a boot loop (confirmed).
# Keep LVGL object count in check instead (lazy-build/tear-down SETUP panels).

# HTTP server: allow enough handlers + WebSocket support for the live control API.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# OTA rollback: on a fresh OTA boot the app is PENDING_VERIFY. If it doesn't call
# esp_ota_mark_app_valid_cancel_rollback() before the next reset the bootloader reverts
# to the previous partition. app_main calls this after full bring-up succeeds, so a
# bad image that crashes before that point auto-reverts without needing a USB reflash.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# FreeRTOS tick at 1 kHz for smooth animation timing.
CONFIG_FREERTOS_HZ=1000

# Main task stack: the IDF default (3584 B) is too tight once BT/NimBLE is enabled —
# app_main's bring-up (nvs_flash_init -> partition mmap, then engine/UI/net/BLE init)
# overruns it, and the overrun surfaces as the cryptic
# "esp_task_stack_is_sane_cache_disabled" assert during the first flash op. Give it room.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ESP32-C6 WiFi co-processor link (esp_hosted over SDIO). These pins are specific
# to the CrowPanel Advance V1.0 board (from the Lesson17 reference config): 1-bit
# SDIO on slot 1, slave reset on GPIO32. esp_hosted's defaults (reset GPIO54) do
# not match this board and cause "failed to read registers" SDIO timeouts.
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_1_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=32
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15

# Build with -O2 (performance), not the IDF default -Og (debug). The UI is
# software-rendered by LVGL (no GPU/PPA blend on this rev v1.3 board), so the CRT
# overlay's full-screen ARGB8888 alpha blends from PSRAM are CPU-bound — -O2 speeds
# those pixel loops 2-4x and is the single biggest frame-rate lever here.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# RGB565 to match the EK79007 panel (LVGL 9 pairs this with the swap_bytes flag set
# in bsp_illuminate.c). Keep it explicit so a menuconfig reset can't drift it.
CONFIG_LV_COLOR_DEPTH_16=y

# LVGL default font (montserrat_14) stays on; the UI itself uses the custom Eurostile
# fonts, so the larger montserrat sizes are not needed.

# LVGL snapshot: lets the firmware capture the screen to a buffer for the
# /screenshot HTTP endpoint (remote visual verification during UI development).
CONFIG_LV_USE_SNAPSHOT=y

# BLE via the C6 controller (CONTACT SIGNATURES instrument). The C6 esp_hosted
# slave already runs the BLE controller; the P4 runs the NimBLE host and routes HCI
# to the C6 over the shared SDIO link (VHCI — no extra pins). NimBLE is lighter than
# Bluedroid. Roles trimmed to scan-only (observer/central) to keep internal RAM —
# esp_hosted's SDIO DMA mempool + WiFi already make it tight. If this triggers the
# "HS_MP: mempool create failed: no mem" boot loop, the lever is
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y (push WiFi/LWIP buffers to PSRAM), NOT
# shrinking LV_MEM. Reference: esp_hosted host_nimble_bleprph_host_only_vhci example.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

# Route LVGL's heap to PSRAM via a custom allocator (main/lv_port_mem.c). LVGL 9 draws
# line/shape anti-alias masks through lv_malloc; the 32 KB builtin INTERNAL pool can't be
# raised (esp_hosted needs that RAM) and exhausts on instrument screens -> NULL ->
# Store-fault in draw_line_skew. PSRAM (32 MB) removes the ceiling, internal RAM untouched.
CONFIG_LV_USE_CUSTOM_MALLOC=y
